Repository: NakusBomber/ProcessorCommands
Catalog: Resources/General.*.resx
Languages: uk

source: About
uk: Про додаток

# AboutWindowTitle
source: About
uk: Про додаток

# AddressAdderDescription
source: Address adder
uk: Суматор адреси

# AddressRegisterDescription
source: Address register
uk: Регістр адреси

# ALU
source: Arithmetic logic unit
uk: Арифметико-логічний пристрій

# AppDevelopedBy
source: The application was developed by Igor Tregub, a student of UST group 943
uk: Додаток розроблений студентом УДУНТ 943 групи - Трегубом Ігорем

# BaseRegisterDescription
source: Base register
uk: Регістр бази

# BinaryLengthShould
source: The length should be 8 bits
uk: Довжина має бути 8 біт

# BinaryMoreThan
source: Exceeded by
uk: Перевищено на

# BinaryNotEnough
source: Not enough
uk: Бракує

# BinaryOnlyZeroOne
source: 0 and 1 only (binary input starting with "0b")
uk: Тільки 0 і 1 (бінарне введення, починаючи з "0b")

# CommandRegisterDescription
source: Command register
uk: Регістр команди

source: Control device
uk: Пристрій управління

source: Copy
uk: Скопіювати

# CounterAddressDescription
source: Counter command's address
uk: Лічильник адреси команди

source: Cut
uk: Вирізати

# DataRegisterDescription
source: Data register
uk: Регістр даних

source: English
uk: Англійська

# FirstRegisterDescription
source: First register
uk: Перший регістр

source: Icons by
uk: Значки з

# IndexRegisterDescription
source: Index register
uk: Регістр індексу

# Info
source: Information
uk: Інформація

source: Language
uk: Мова

# MainWindowTitle
source: Demonstration of command execution
uk: Демонстрація виконання команди

source: Paste
uk: Вставити

# PushZero
source: Append to byte
uk: Доповнити до байту

# RAMDescription
source: Address
uk: Адреса

source: Reference
uk: Довідка

source: Refresh
uk: Очистити

# ResultRegisterDescription
source: Result register
uk: Регістр результату

# SecondRegisterDescription
source: Second register
uk: Другий регістр

source: Settings
uk: Налаштування

source: Start
uk: Старт

# StatusDescription
source: Status
uk: Статус

source: Step
uk: Крок

source: Stop
uk: Стоп

source: Ukrainian
uk: Українська

# ValueDescription
source: Value
uk: Значення

# WordRegisterDescription
source: Word register
uk: Регістр слова
